package com.perenc.xh.commonUtils.utils.baidu;

import com.baidu.aip.speech.AipSpeech;
import com.baidu.aip.speech.TtsResponse;
import com.baidu.aip.util.Util;
import org.json.JSONObject;

import java.io.IOException;
import java.util.HashMap;

/**
 * @Description TDDO
 * @Author xiaobai
 * @Date 2019/2/27 16:47
 **/
public class BDSpeakUtil {
    //设置APPID/AK/SK
    public static final String APP_ID = "15423285";
    public static final String API_KEY = "pZaE4kf8HYbQEl1jG2gNxgDi";
    public static final String SECRET_KEY = "NGFv7fiwGVgLQHiiFKVELB0NFHvimlOk";


    public static String getTextConvMp3(String text,String outpath) {
        String outputPath="";
        // 初始化一个AipSpeech
        AipSpeech client = new AipSpeech(APP_ID, API_KEY, SECRET_KEY);

        // 可选：设置网络连接参数
        client.setConnectionTimeoutInMillis(2000);
        client.setSocketTimeoutInMillis(60000);
        HashMap<String, Object> options = new HashMap<String, Object>();
        options.put("spd", "5");
        options.put("pit", "5");
        options.put("per", "4");
        // 调用接口
        TtsResponse res = client.synthesis(text, "zh", 1, options);
        byte[] data = res.getData();
        JSONObject res1 = res.getResult();
        if (data != null) {
            try {
                Util.writeBytesToFileSystem(data, outpath);
                outputPath=outpath;
            } catch (IOException e) {
                e.printStackTrace();
            }
            return outputPath;
        }
        System.out.println("转换成功========="+outputPath);
        return "";

    }

//    public static void main(String[] args) {
//        getTextConvMp3("内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！" +
//                "内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！"+
//                "内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！"+
//                "内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！"+
//                "内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！"+
//                "内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！"+
//                "内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！"+
//                "内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！"+
//                "内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！"+
//                "内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！"+
//                "内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！"+
//                "内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！"+
//                "内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！内外平安好运来，合家欢乐财源进，你好，小慧祝您及家人新年快乐！","D:\\logs\\sound\\output.mp3");
//    }
}
